Deliverables



1. A report (in the form of a presentation, both verbal and through a slides)


2. A github repository containing your jupyter notebook that walks through the pipeline along with the .py files necessary to reproduce your model.

In [26]:
import wrangle
import pandas as pd
import numpy as np

In [27]:
#use wrangle.py to import data from mySQL
df =wrangle.get_data_from_sql()

In [28]:
# check DF head
df.head()

,bathrooms,bedrooms,square_feet,fips,lot_size,pool,zip_code,year_built,assessed_value,tax_value,transaction_date
0,2.0,3.0,1458.0,6037.0,8284.0,1.0,97318.0,1970.0,136104.0,2319.90,2017-06-23
1,1.0,2.0,1421.0,6037.0,6707.0,NaN,96018.0,1911.0,35606.0,543.69,2017-06-30
2,3.0,4.0,2541.0,6059.0,4975.0,NaN,96958.0,2003.0,880456.0,9819.72,2017-06-01
3,2.0,3.0,1650.0,6037.0,7300.0,NaN,96037.0,1949.0,614000.0,7673.19,2017-06-01
4,1.0,2.0,693.0,6037.0,2908.0,NaN,96023.0,1921.0,274237.0,3267.47,2017-06-29

In [29]:
# check DF tail
df.tail()

,bathrooms,bedrooms,square_feet,fips,lot_size,pool,zip_code,year_built,assessed_value,tax_value,transaction_date
14985,3.0,5.0,2526.0,6059.0,7800.0,1.0,97018.0,1994.0,458903.0,5718.72,2017-06-30
14986,3.0,5.0,2735.0,6059.0,7100.0,1.0,97067.0,1963.0,115387.0,1465.88,2017-06-30
14987,2.0,3.0,1536.0,6037.0,8818.0,1.0,96523.0,1955.0,297097.0,3519.78,2017-06-30
14988,3.0,5.0,2655.0,6059.0,6000.0,NaN,97065.0,1994.0,746963.0,8065.50,2017-06-30
14989,3.0,4.0,2305.0,6037.0,5742.0,NaN,96129.0,1949.0,579047.0,6996.21,2017-06-30

In [30]:
# there are null values in lot_size, pool, zip_code, year_built and tax-value
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14990 entries, 0 to 14989
Data columns (total 11 columns):
bathrooms           14990 non-null float64
bedrooms            14990 non-null float64
square_feet         14990 non-null float64
fips                14990 non-null float64
lot_size            14893 non-null float64
pool                3287 non-null float64
zip_code            14982 non-null float64
year_built          14974 non-null float64
assessed_value      14990 non-null float64
tax_value           14989 non-null float64
transaction_date    14990 non-null object
dtypes: float64(10), object(1)
memory usage: 1.3+ MB

In [31]:
df.tax_value.isnull().sum()

1

In [32]:
df = df.dropna(subset=['lot_size', 'year_built', 'tax_value', 'zip_code'])

In [35]:
df.fillna(0, inplace = True)

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14873 entries, 0 to 14989
Data columns (total 11 columns):
bathrooms           14873 non-null float64
bedrooms            14873 non-null float64
square_feet         14873 non-null float64
fips                14873 non-null float64
lot_size            14873 non-null float64
pool                14873 non-null float64
zip_code            14873 non-null float64
year_built          14873 non-null float64
assessed_value      14873 non-null float64
tax_value           14873 non-null float64
transaction_date    14873 non-null object
dtypes: float64(10), object(1)
memory usage: 1.4+ MB

In [47]:
df['fips'] =df.fips.astype(int)
df['zip_code'] =df.zip_code.astype(int)
df['year_built'] =df.year_built.astype(int)
df['lot_size'] =df.lot_size.astype(int)
df['pool'] =df.pool.astype(int)

In [51]:
df.head()

,bathrooms,bedrooms,square_feet,fips,lot_size,pool,zip_code,year_built,assessed_value,tax_value,transaction_date,tax_rate
0,2.0,3.0,1458.0,6037,8284,1,97318,1970,136104.0,2319.90,2017-06-23,0.017045
1,1.0,2.0,1421.0,6037,6707,0,96018,1911,35606.0,543.69,2017-06-30,0.015270
2,3.0,4.0,2541.0,6059,4975,0,96958,2003,880456.0,9819.72,2017-06-01,0.011153
3,2.0,3.0,1650.0,6037,7300,0,96037,1949,614000.0,7673.19,2017-06-01,0.012497
4,1.0,2.0,693.0,6037,2908,0,96023,1921,274237.0,3267.47,2017-06-29,0.011915

In [50]:
df['tax_rate'] = df.tax_value/df.assessed_value